 ## Topic covered in Pandas
 + Creating DataFrames
 + Dealing with rows & column
 + Operation:Min,Max,std,describe
 + Conditional selection
 + set index

In [1]:
import pandas as pd # Creating the DataFrame using dict function
Tabular_set={
    'serial_no':['1','2','3','4','5','6'],
    'First_name':['Shivani','Shraddha','sita','shivam','sunny','radhika'],
    'Place':['New Delhi','Mumbai','Greater kalash','Indore','Haldwani','Kanpur'],
    'Job_Id':['IN005626','IN006366','IN006336','IN005616','IN006366','IN006111'],
    'Temperature':['80.2','92','87','85','79','98']
              }
df=pd.DataFrame(Tabular_set)
df

  serial_no First_name           Place    Job_Id Temperature
0         1    Shivani       New Delhi  IN005626        80.2
1         2   Shraddha          Mumbai  IN006366          92
2         3       sita  Greater kalash  IN006336          87
3         4     shivam          Indore  IN005616          85
4         5      sunny        Haldwani  IN006366          79
5         6    radhika          Kanpur  IN006111          98

In [2]:
df.shape   # This shows the no of rows and column

(6, 5)

In [3]:
rows , columns = df.shape  # This code helps to saves the rows and column  when you type row or column it will show the result

In [4]:
rows

6

In [5]:
columns

5

In [6]:
df.head()    # This print only few dataset not entire dataset

  serial_no First_name           Place    Job_Id Temperature
0         1    Shivani       New Delhi  IN005626        80.2
1         2   Shraddha          Mumbai  IN006366          92
2         3       sita  Greater kalash  IN006336          87
3         4     shivam          Indore  IN005616          85
4         5      sunny        Haldwani  IN006366          79

In [7]:
df.head(3)   # This helps to print only defined rows which you mentioned in the head()

  serial_no First_name           Place    Job_Id Temperature
0         1    Shivani       New Delhi  IN005626        80.2
1         2   Shraddha          Mumbai  IN006366          92
2         3       sita  Greater kalash  IN006336          87

In [8]:
df.tail()  # This will print the last row

  serial_no First_name           Place    Job_Id Temperature
1         2   Shraddha          Mumbai  IN006366          92
2         3       sita  Greater kalash  IN006336          87
3         4     shivam          Indore  IN005616          85
4         5      sunny        Haldwani  IN006366          79
5         6    radhika          Kanpur  IN006111          98

In [9]:
df.tail(2)  # This print last 2 required row or any you mention in tail()

  serial_no First_name     Place    Job_Id Temperature
4         5      sunny  Haldwani  IN006366          79
5         6    radhika    Kanpur  IN006111          98

In [10]:
df[2:4]  # slicing can be possibile

  serial_no First_name           Place    Job_Id Temperature
2         3       sita  Greater kalash  IN006336          87
3         4     shivam          Indore  IN005616          85

In [11]:
df[:]

  serial_no First_name           Place    Job_Id Temperature
0         1    Shivani       New Delhi  IN005626        80.2
1         2   Shraddha          Mumbai  IN006366          92
2         3       sita  Greater kalash  IN006336          87
3         4     shivam          Indore  IN005616          85
4         5      sunny        Haldwani  IN006366          79
5         6    radhika          Kanpur  IN006111          98

In [12]:
df.columns   # Shows the numbers of columns

Index(['serial_no', 'First_name', 'Place', 'Job_Id', 'Temperature'], dtype='object')

In [13]:
df['First_name']

0     Shivani
1    Shraddha
2        sita
3      shivam
4       sunny
5     radhika
Name: First_name, dtype: object

In [14]:
df.First_name  # Can print what ever column you wish to print just type name or df['Place']

0     Shivani
1    Shraddha
2        sita
3      shivam
4       sunny
5     radhika
Name: First_name, dtype: object

In [15]:
df['Place']  # df.Place

0         New Delhi
1            Mumbai
2    Greater kalash
3            Indore
4          Haldwani
5            Kanpur
Name: Place, dtype: object

In [16]:
type(df.Place)   # To defined the type of data

pandas.core.series.Series

In [17]:
df[['Job_Id','First_name']]  # If you wish to add two column in the dataframe

     Job_Id First_name
0  IN005626    Shivani
1  IN006366   Shraddha
2  IN006336       sita
3  IN005616     shivam
4  IN006366      sunny
5  IN006111    radhika

In [18]:
df['Temperature'].std

<bound method NDFrame._add_numeric_operations.<locals>.std of 0    80.2
1      92
2      87
3      85
4      79
5      98
Name: Temperature, dtype: object>

In [19]:
df.describe()   # This will display the statistics and insite of the data

       serial_no First_name      Place    Job_Id Temperature
count          6          6          6         6           6
unique         6          6          6         5           6
top            1    Shivani  New Delhi  IN006366        80.2
freq           1          1          1         2           1

In [24]:
df.describe().transpose()

            count unique        top freq
serial_no       6      6          1    1
First_name      6      6    Shivani    1
Place           6      6  New Delhi    1
Job_Id          6      5   IN006366    2
Temperature     6      6       80.2    1

In [20]:
df.index  # To find the index

RangeIndex(start=0, stop=6, step=1)

In [21]:
df.info

<bound method DataFrame.info of   serial_no First_name           Place    Job_Id Temperature
0         1    Shivani       New Delhi  IN005626        80.2
1         2   Shraddha          Mumbai  IN006366          92
2         3       sita  Greater kalash  IN006336          87
3         4     shivam          Indore  IN005616          85
4         5      sunny        Haldwani  IN006366          79
5         6    radhika          Kanpur  IN006111          98>

In [26]:
df.head(2)

  serial_no First_name      Place    Job_Id Temperature
0         1    Shivani  New Delhi  IN005626        80.2
1         2   Shraddha     Mumbai  IN006366          92

In [33]:
X=df.Place
y=df.Temperature

0    80.2
1      92
2      87
3      85
4      79
5      98
Name: Temperature, dtype: object